// fallback
const u8 gFallbackPokedexText[] = _(
    "זהו פוקימון שהתגלה לאחרונה.\n"
    "הוא נחקר בימים אלה, ובשלב זה\n"
    "עדיין אין עליו מידע מפורט.");

// Gen 1 families
const u8 gRaticateAlolaPokedexText[] = _(
    "הוא מקים קבוצה של רטטה ומפקד\n"
    "עליה. לכל קבוצה יש שטח משלה,\n"
    "ומריבות על מזון פורצות\n"
    "לעיתים קרובות.");

const u8 gPichuPokedexText[] = _(
    "הוא עדיין לא מיומן באגירת חשמל.\n"
    "כשהוא נבהל, הוא משחרר מטען בטעות.\n"
    "ככל שהוא מתבגר, הוא משתפר\n"
    "באגירת החשמל.");

const u8 gPikachuPokedexText[] = _(
    "הוא אוגר חשמל בשקיקי החשמל\n"
    "שבלחייו. כשהוא משחרר בבת אחת\n"
    "את האנרגיה האגורה, עוצמת החשמל\n"
    "שווה לזו של ברק.");

const u8 gMarowakAlolaPokedexText[] = _(
    "אומרים שהלהבות המקוללות שמאירות\n"
    "את העצם שהפוקימון הזה נושא\n"
    "גורמות לכאב נפשי וגופני\n"
    "שלעולם לא יחלוף.");

const u8 gEeveePokedexText[] = _(
    "לאיווי יש מבנה גנטי לא יציב, שעובר\n"
    "מוטציה פתאומית בהשפעת סביבתו.\n"
    "קרינה מאבנים שונות גורמת\n"
    "לפוקימון הזה להתפתח.");

// Gen 2 families
const u8 gUnownPokedexText[] = _(
    "צורתו של הפוקימון הזה דומה לאותיות\n"
    "של כתב עתיק. למרות שהמחקר נמשך,\n"
    "עדיין לא ידוע מה הופיע קודם:\n"
    "הכתבים העתיקים או האנון למיניהם.");

// Gen 4 families
const u8 gMothimPokedexText[] = _(
    "אין לו קן. אף שהוא אוהב דבש פרחים,\n"
    "הוא לא אוסף אותו בעצמו. במקום זאת,\n"
    "הוא זומם לגנוב דבש שקומבי אספו.");

const u8 gArceusPokedexText[] = _(
    "מסופר במיתולוגיה שהפוקימון הזה\n"
    "בקע מביצה ועיצב את כל מה שיש\n"
    "בעולם הזה, עוד לפני שהיקום\n"
    "בכלל היה קיים.");

// Gen 5 families
const u8 gGenesectPokedexText[] = _(
    "לפני יותר מ-300 מיליון שנה\n"
    "פחדו ממנו כחזק שבציידים.\n"
    "Team Plasma שינה אותו\n"
    "והצמיד תותח לגבו.");

// Gen 6 families
const u8 gGreninjaPokedexText[] = _(
    "הוא מופיע ונעלם בקלילות של נינג'ה.\n"
    "הוא משתעשע באויביו בתנועות מהירות,\n"
    "וחותך אותם בכוכבי זריקה\n"
    "שעשויים ממים דחוסים.");

const u8 gScatterbugPokedexText[] = _(
    "כשפוקימוני ציפור תוקפים אותו, הוא\n"
    "פולט אבקה שחורה ורעילה שגורמת\n"
    "לשיתוק במגע. סקטרבאג יכול לחיות\n"
    "בכל אזור ובכל אקלים.");

const u8 gSpewpaPokedexText[] = _(
    "הוא חי חבוי בצללי הסבך.\n"
    "כשטורפים תוקפים, הוא מזקיף במהירות\n"
    "את הפרווה שמכסה את גופו\n"
    "בניסיון לאיים עליהם.");

const u8 gFurfrouPokedexText[] = _(
    "גיזום פרוותו הרכה לא רק הופך אותו\n"
    "לאלגנטי יותר, אלא גם מגביר את\n"
    "מהירות תנועותיו. פוקימונים אלה\n"
    "היו שומריהם של מלכים.");

const u8 gXerneasPokedexText[] = _(
    "האגדות מספרות שכשהקרניים שעל ראשו\n"
    "זוהרות בשבעה צבעים, הוא מעניק חיי נצח.\n"
    "הוא ישן במשך אלף שנים בדמות עץ.");

const u8 gZygarde50PokedexText[] = _(
    "אומרים שהוא משגיח על המערכת האקולוגית\n"
    "ממעמקי המערות שבהן הוא חי.\n"
    "לפי השמועות, כוח גדול עוד יותר\n"
    "חבוי בתוך התאים שלו.");

const u8 gZygarde10PokedexText[] = _(
    "זהו זייגארד לאחר שהורכבו\n"
    "כ-10% מחלקיו. הוא מזנק אל חזה\n"
    "יריבו ונועץ בו את ניביו החדים.");

// Gen 7 families
const u8 gGumshoosPokedexText[] = _(
    "כשהוא מוצא עקבות של טרפו, הוא\n"
    "אורב במקום בסבלנות… אבל מכיוון\n"
    "שהוא פעיל ביום, הוא תמיד מנמנם\n"
    "כבר עם רדת הלילה.");

const u8 gVikavoltPokedexText[] = _(
    "הוא מרכז אנרגיה חשמלית בלסתותיו\n"
    "הגדולות ומשתמש בה כדי לחשמל את אויביו.\n"
    "הוא מכריע פוקימוני ציפור\n"
    "בקרני אנרגיה חשמלית מהממות.");

const u8 gRibombeePokedexText[] = _(
    "ריבומבי מגלגל אבקת פרחים לכדורים.\n"
    "הוא מכין סוגים רבים ושונים, חלקם\n"
    "משמשים כמזון ואחרים משמשים בקרב.\n"
    "לעיתים הם נמכרים כתוספי תזונה.");

const u8 gRockruffPokedexText[] = _(
    "הפוקימון הזה חי לצד בני אדם\n"
    "מימים עברו. הוא מרגיש כשהמאמן שלו\n"
    "מדוכדך, ואז הוא נשאר צמוד\n"
    "לצדו של המאמן.");

const u8 gAraquanidPokedexText[] = _(
    "בניגוד למה שמראהו מרמז, הוא דואג\n"
    "לאחרים. אם הוא מוצא פוקימונים חלשים\n"
    "ופגיעים, הוא מכניס אותם\n"
    "לבועת המים שלו כדי להגן עליהם.");

const u8 gLurantisPokedexText[] = _(
    "שימור צבעיו העזים של לורנטיס דורש\n"
    "מאמץ רב, אך יש אספנים שנהנים\n"
    "מהעבודה הזאת ורואים בה תחביב.");

const u8 gSalazzlePokedexText[] = _(
    "משום מה, נמצאו רק נקבות. סלאזל\n"
    "יוצר לעצמו הרמון הפוך של סלאנדיט\n"
    "זכרים שחיים איתו. הגז הרעיל שלו\n"
    "מלא בפרומונים.");

const u8 gSilvallyNormalPokedexText[] = _(
    "האמון בשותפו הוא שמעורר אותו.\n"
    "הפוקימון הזה מסוגל לשנות את סוגו\n"
    "על ידי הצטיידות בזיכרונות מיוחדים,\n"
    "תכונה שבאה לידי ביטוי היטב בקרב.");

const u8 gSilvallyMemoryPokedexText[] = _(
    "כשהוא מתעורר, מערכת RKS שלו מופעלת.\n"
    "בעזרת זיכרונות מסוימים, הפוקימון הזה\n"
    "יכול להתאים את סוגו כדי לבלבל\n"
    "את אויביו.");

const u8 gMiniorMeteorPokedexText[] = _(
    "במקור הוא חי בשכבת האוזון, וצונח\n"
    "אל הקרקע כשהקליפה שעוטפת את גופו\n"
    "נעשית כבדה מדי. הוא נולד מננו-חלקיקים\n"
    "שעברו מוטציה.");

const u8 gMiniorCorePokedexText[] = _(
    "אם הליבה שלו נשארת חשופה, הוא\n"
    "ימות בקרוב. ייתכן שהוא ישרוד\n"
    "אם יכניסו אותו לפוקיבול\n"
    "מהר מספיק.");

const u8 gTogedemaruPokedexText[] = _(
    "בדרך כלל, הפרווה הקוצנית שעל גבו\n"
    "שטוחה. כשהפוקימון הזה נסער, פרוותו\n"
    "סומרת ודוקרת את התוקפים שלו.");

const u8 gMimikyuDisguisedPokedexText[] = _(
    "פוקימון בודד שמסתיר את מראהו המפחיד\n"
    "מתחת לסמרטוט ישן, כדי שיוכל להתקרב\n"
    "לאנשים ולפוקימונים אחרים.\n"
    "מראהו האמיתי אינו ידוע.");

const u8 gMimikyuBustedPokedexText[] = _(
    "אחרי כל המאמץ שהשקיע בתחפושת,\n"
    "הצוואר שלו נשבר. מה שבפנים כנראה\n"
    "לא נפגע, אבל הוא עדיין\n"
    "מרגיש עצוב.");

const u8 gKommoOPokedexText[] = _(
    "הקשקשים הנוקשים שלו משמשים\n"
    "להתקפה ולהגנה. בעבר עיבדו את\n"
    "הקשקשים שלו והשתמשו בהם לייצור\n"
    "כלי נשק ומוצרים יקרי ערך אחרים.");

// Gen 8 families
const u8 gAlcremieVanillaCreamPokedexText[] = _(
    "כשאלקרמי מרוצה, השמנת שמופרשת\n"
    "מידיו נעשית מתוקה ועשירה יותר.\n"
    "כשהוא סומך על מאמן, הוא מפנק אותו\n"
    "בפירות שקישט בשמנת.");

const u8 gAlcremieRubyCreamPokedexText[] = _(
    "ברגע שהתפתח, הוא קיבל טעם מתוק-חמצמץ.\n"
    "הסיבה לכך היא שהתאים שלו השתנו\n"
    "באופן ספונטני במהלך ההתפתחות.");

const u8 gAlcremieMatchaCreamPokedexText[] = _(
    "ברגע שהתפתח, הוא קיבל טעם ארומטי.\n"
    "הסיבה לכך היא שהתאים שלו השתנו\n"
    "באופן ספונטני במהלך ההתפתחות.");

const u8 gAlcremieMintCreamPokedexText[] = _(
    "ברגע שהתפתח, הוא קיבל טעם מרענן.\n"
    "הסיבה לכך היא שהתאים שלו השתנו\n"
    "באופן ספונטני במהלך ההתפתחות.");

const u8 gAlcremieLemonCreamPokedexText[] = _(
    "ברגע שהתפתח, הוא קיבל טעם חמוץ.\n"
    "הסיבה לכך היא שהתאים שלו השתנו\n"
    "באופן ספונטני במהלך ההתפתחות.");

const u8 gAlcremieSaltedCreamPokedexText[] = _(
    "ברגע שהתפתח, הוא קיבל טעם מלוח.\n"
    "הסיבה לכך היא שהתאים שלו השתנו\n"
    "באופן ספונטני במהלך ההתפתחות.");

const u8 gAlcremieRubySwirlPokedexText[] = _(
    "ברגע שהתפתח, הוא קיבל טעם מעורב.\n"
    "הסיבה לכך היא שהתאים שלו השתנו\n"
    "באופן ספונטני במהלך ההתפתחות.");

const u8 gAlcremieCaramelSwirlPokedexText[] = _(
    "ברגע שהתפתח, הוא קיבל טעם מר.\n"
    "הסיבה לכך היא שהתאים שלו השתנו\n"
    "באופן ספונטני במהלך ההתפתחות.");

const u8 gAlcremieRainbowSwirlPokedexText[] = _(
    "ברגע שהתפתח, הוא קיבל טעם מורכב.\n"
    "הסיבה לכך היא שהתאים שלו השתנו\n"
    "באופן ספונטני במהלך ההתפתחות.");

const u8 gToxtricityGigantamaxPokedexText[] = _(
    "הוא יצא משליטה אחרי שהרעל שלו עצמו\n"
    "חדר למוחו. הוא משתולל ברחבי הארץ\n"
    "ומזהם את האדמה בזיעה רעילה.");

// Gen 9 families
const u8 gOgerponTealMaskPokedexText[] = _(
    "הסוג של הפוקימון הזה משתנה לפי המסכה\n"
    "שהוא עוטה. הוא מבלבל את אויביו\n"
    "בתנועות זריזות ובבעיטות.");

const u8 gOgerponWellspringMaskPokedexText[] = _(
    "בצורה הזו הוא מצטיין גם בהתקפה\n"
    "וגם בהגנה. בלי הפסקה הוא משחרר\n"
    "מהלכים, כמו מים שפורצים ממעיין.");

const u8 gOgerponHearthflameMaskPokedexText[] = _(
    "זוהי צורתו התוקפנית ביותר.\n"
    "הוא מפגיז את אויביו בעוצמה\n"
    "של להבות שבוערות באח.");

const u8 gOgerponCornerstoneMaskPokedexText[] = _(
    "בצורה הזו הוא שואב את כוחה של האבן.\n"
    "גופו מוצק כסלע ומגן עליו\n"
    "מפני התקפות מכל סוג.");
